Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.ModelInternal.InputGeometryEvents)
Creates a new InputGeometry instance for line.
line: The line to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Model.Polygon,Tekla.Structures.ModelInternal.InputGeometryEvents)
Creates a new InputGeometry instance for polygon.
polygon: The polygon to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(Tekla.Structures.Geometry3d.PolyLine,Tekla.Structures.ModelInternal.InputGeometryEvents)
Creates a new InputGeometry instance for polyline.
polyLine: The polyline to be used in input object.
events: The attached event listener.

Tekla.Structures.ModelInternal.InputGeometry.#ctor(System.Collections.Generic.List{Tekla.Structures.Model.ContourPoint},Tekla.Structures.ModelInternal.InputGeometryEvents,System.Boolean)
Creates a new InputGeometry instance for polyline.
contour: The contour points to be used in input object.
events: The attached event listener.
closed: Optional parameter to define if polyLine is closed or not (== default).